### Terraform Plan: `nrds` ✅

**Plan: 1 to add, 0 to change, 0 to destroy.**

<details><summary>Show Plan Details</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.nrds_orchestration.local_file.write_arn will be created
  + resource "local_file" "write_arn" {
      + content              = "arn:aws:states:us-east-1:879381264451:stateMachine:nrds_prod_sm"
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../modules/orchestration/sm_ARN.txt"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @harshavemula-ua, Action: `pull_request`, Workflow: `Terraform PR Validation`*